src/testsuite_old/sysbench/results/oltp_update_non_index.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 548.77 qps: 548.77 (r/w/o: 0.00/548.77/0.00) lat (ms,95%): 634.66 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 566.15 qps: 566.15 (r/w/o: 0.00/566.15/0.00) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 296.05 qps: 296.05 (r/w/o: 0.00/296.05/0.00) lat (ms,95%): 1109.09 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           27532
        other:                           0
        total:                           27532
    transactions:                        27532  (458.03 per sec.)
    queries:                             27532  (458.03 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      458.0322
    time elapsed:                        60.1108s
    total number of events:              27532

Latency (ms):
         min:                                   59.79
         avg:                                  280.06
         max:                                 1233.64
         95th percentile:                      759.88
         sum:                              7710712.44

Threads fairness:
    events (avg/stddev):           215.0938/2.24
    execution time (avg/stddev):   60.2399/0.01

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 497.21 qps: 497.21 (r/w/o: 0.00/497.21/0.00) lat (ms,95%): 601.29 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 1002.80 qps: 1002.80 (r/w/o: 0.00/1002.80/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 1028.00 qps: 1028.00 (r/w/o: 0.00/1028.00/0.00) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           51798
        other:                           0
        total:                           51798
    transactions:                        51798  (862.49 per sec.)
    queries:                             51798  (862.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      862.4876
    time elapsed:                        60.0579s
    total number of events:              51798

Latency (ms):
         min:                                   49.88
         avg:                                  148.77
         max:                                  678.77
         95th percentile:                      484.44
         sum:                              7705803.51

Threads fairness:
    events (avg/stddev):           404.6719/2.68
    execution time (avg/stddev):   60.2016/0.01